In [1]:
import pandas as pd

income_df = pd.read_excel('ny_zip_income.xls',header=3,usecols=[0,1,2,16,17,18])

In [2]:
income_df.head().T

,0,1,2,3,4
ZIP\ncode [1],NaN,NaN,0,0,0
Size of adjusted gross income,NaN,NaN,Total,"$1 under $25,000","$25,000 under $50,000"
Number of returns,NaN,-1,9.46806e+06,3.44531e+06,2.12396e+06
Adjusted gross income (AGI) [4],NaN,-15,7.84411e+08,4.19902e+07,7.72745e+07
Total income,Number of returns,-16,9468050,3445290,2123960
Unnamed: 18,Amount,-17,795119743,42897756,78326525

In [3]:
income_df = income_df.rename(columns={income_df.columns[0]: "zip_code", 
                                      income_df.columns[1]: "agi_bucket", 
                                      income_df.columns[2]: "num_returns", 
                                      income_df.columns[3]: "agi", 
                                      income_df.columns[4]: "tot_inc_num_returns", 
                                      income_df.columns[5]: "tot_inc_amnt"})
income_df = income_df.iloc[3:12329]

In [4]:
income_df['agi'] = income_df['agi']*1000
income_df['tot_inc_amnt'] = income_df['tot_inc_amnt']*1000

In [5]:
income_df.dropna(subset=['agi_bucket'],inplace=True)

In [6]:
income_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9246 entries, 3 to 12328
Data columns (total 6 columns):
zip_code               9246 non-null object
agi_bucket             9246 non-null object
num_returns            9246 non-null float64
agi                    9246 non-null float64
tot_inc_num_returns    9246 non-null object
tot_inc_amnt           9246 non-null object
dtypes: float64(2), object(4)
memory usage: 505.6+ KB

In [7]:
income_df = income_df.iloc[6:-6] #remove Zipcodes 0 & 99999

In [8]:
income_df.reset_index(drop=True,inplace=True)

In [9]:
income_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9234 entries, 0 to 9233
Data columns (total 6 columns):
zip_code               9234 non-null object
agi_bucket             9234 non-null object
num_returns            9234 non-null float64
agi                    9234 non-null float64
tot_inc_num_returns    9234 non-null object
tot_inc_amnt           9234 non-null object
dtypes: float64(2), object(4)
memory usage: 432.9+ KB

In [10]:
income_df.head()

,zip_code,agi_bucket,num_returns,agi,tot_inc_num_returns,tot_inc_amnt
0,10001,"$1 under $25,000",3740.0,43182000.0,3740,44849000
1,10001,"$25,000 under $50,000",2500.0,92133000.0,2500,94324000
2,10001,"$50,000 under $75,000",1950.0,120922000.0,1950,123197000
3,10001,"$75,000 under $100,000",1410.0,121880000.0,1410,123605000
4,10001,"$100,000 under $200,000",2580.0,361453000.0,2580,366195000

In [11]:
income_df[income_df['tot_inc_num_returns'] != income_df['num_returns']]

,zip_code,agi_bucket,num_returns,agi,tot_inc_num_returns,tot_inc_amnt
1584,11355,"$1 under $25,000",34950.0,401891000.0,34940,412155000
7067,13833,"$200,000 or more",30.0,12181000.0,20,12181000
9105,14874,"$75,000 under $100,000",20.0,2656000.0,30,2656000

In [12]:
income_df['zip_code'].astype('int64')

0       10001
1       10001
2       10001
3       10001
4       10001
5       10001
6       10002
7       10002
8       10002
9       10002
10      10002
11      10002
12      10003
13      10003
14      10003
15      10003
16      10003
17      10003
18      10004
19      10004
20      10004
21      10004
22      10004
23      10004
24      10005
25      10005
26      10005
27      10005
28      10005
29      10005
        ...
9204    14898
9205    14898
9206    14898
9207    14898
9208    14898
9209    14898
9210    14901
9211    14901
9212    14901
9213    14901
9214    14901
9215    14901
9216    14903
9217    14903
9218    14903
9219    14903
9220    14903
9221    14903
9222    14904
9223    14904
9224    14904
9225    14904
9226    14904
9227    14904
9228    14905
9229    14905
9230    14905
9231    14905
9232    14905
9233    14905
Name: zip_code, Length: 9234, dtype: int64

### Filter New York State zip codes down to only New York City zip codes

In [13]:
nyc_zips_df = pd.read_csv('zip_borough.csv',usecols=[0]) #SOURCE: https://www.kaggle.com/kimjinyoung/nyc-borough-zip/downloads/nyc-borough-zip.zip/2

In [14]:
nyc_zips_df.head()

     zip
0  10001
1  10002
2  10003
3  10004
4  10005

In [17]:
income_df = income_df[income_df['zip_code'].isin(nyc_zips_df['zip'])].reset_index(drop=True)

In [22]:
income_df['tot_inc_num_returns'] = income_df['tot_inc_num_returns'].astype('float64')
income_df['tot_inc_amnt'] = income_df['tot_inc_amnt'].astype('float64')

In [23]:
income_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1062 entries, 0 to 1061
Data columns (total 6 columns):
zip_code               1062 non-null object
agi_bucket             1062 non-null object
num_returns            1062 non-null float64
agi                    1062 non-null float64
tot_inc_num_returns    1062 non-null float64
tot_inc_amnt           1062 non-null float64
dtypes: float64(4), object(2)
memory usage: 49.9+ KB

In [ ]:
playgrounds_df = pd.read_json('DPR_Playgrounds_001.json')
parks_df = pd.read_json('DPR_Parks_001.json')
nyc_zips_df = pd.read_csv('zip_borough.csv')